#+TITLE: MM5016 Laboration 8 Error analysis
#+DATE: \today
#+OPTIONS: num:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t toc:nil todo:t |:t
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: se
#+LaTeX_CLASS: notesse
#+LATEX_HEADER: \input{/home/john/texstuff/org/env.tex}
#+LATEX_HEADER: \input{/home/john/texstuff/org/bold.tex}
#+STARTUP: latexpreview

** Stuff :noexport:
#+begin_src python :results output :session
import math
R = 22.2
dR = 0.1
r = 12.0
dr = 1.2
h = 24.4
dh = 1.1

p1 = R ** 3 + 3 * (R ** 2) * dR
print("p1:", p1)
p2 = (r ** 2) * h + (r ** 2) * dh + 2 * r * dh
print("p2:", p2)

fp3 = (4 * math.pi) / 3
pi = math.pi
t = fp3 * p1 + pi * p2
print("t:", t)
#+end_src

#+RESULTS:
: p1: 11088.9
: p2: 3698.4
: t: 58067.9419718923

